_Rarzrabotki/Rarus/USO2/InformationRegisters/ДанныеПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПроизводственногоКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерабочий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/АУН_ОбщиеПроцедурыКлиентСервер/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Функция получает стандартную структуру реквизитов объекта для использования в подсистеме АрендаНедвижимости.
Функция ПолучитьКоллекциюРеквизитов(ДокументОбъект) Экспорт
	
	ЭтоТиповойДокумент = ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
						ИЛИ ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента");
						
	КоллекцияРеквизитов = Новый Структура;
	КоллекцияРеквизитов.Вставить("ОбъектАренды", 			"АУН_ОбъектАренды");
	КоллекцияРеквизитов.Вставить("СпособНачисления", 		"АУН_СпособНачисления");
	КоллекцияРеквизитов.Вставить("СтавкаСпособаНачисления", "АУН_СтавкаСпособаНачисления");
	КоллекцияРеквизитов.Вставить("КоличествоДней", 			"АУН_КоличествоДней");
	Если ЭтоТиповойДокумент Тогда
		КоллекцияРеквизитов.Вставить("НачалоПериода", 		"АУН_НачалоПериода");
		КоллекцияРеквизитов.Вставить("ОкончаниеПериода",	"АУН_ОкончаниеПериода");
		КоллекцияРеквизитов.Вставить("ВидПериода", 			"АУН_ВидПериода");
		// для правильного заполнения реквизитов таб. части
		КоллекцияРеквизитов.Вставить("Количество", 			"КоличествоУпаковок");
	
	Иначе
		КоллекцияРеквизитов.Вставить("НачалоПериода", 		"НачалоПериода");
		КоллекцияРеквизитов.Вставить("ОкончаниеПериода",	"ОкончаниеПериода");
		КоллекцияРеквизитов.Вставить("ВидПериода", 			"ВидПериода");
	КонецЕсли;
	
	Возврат КоллекцияРеквизитов;
	
КонецФункции

// Процедуру приводит структуру реквизитов к стандартной структуре реквизитов объекта
// для использования в подсистеме АрендаНедвижимости.
Процедура ПривестиСтруктуруДанныхКСтандартнымИменам(Данные, КоллекцияРеквизитов, ОбратноеДействие = Ложь) Экспорт
	
	Если НЕ ОбратноеДействие Тогда
		КлючЗначение = Новый Структура("Ключ, Значение", "Ключ", "Значение");
	Иначе
		КлючЗначение = Новый Структура("Ключ, Значение", "Значение", "Ключ");
	КонецЕсли;
	
	Для Каждого Элемент Из КоллекцияРеквизитов Цикл
		Если Данные.Свойство(Элемент[КлючЗначение.Значение]) Тогда
			Данные.Вставить(Элемент[КлючЗначение.Ключ], Данные[Элемент[КлючЗначение.Значение]]);
			Данные.Удалить(Элемент[КлючЗначение.Значение]);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Функция ДобавитьКДатеДни(Дата, КоличествоДней, УчитыватьТолькоРабочие = Ложь) Экспорт 
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат Дата;
	КонецЕсли;
	
	Если УчитыватьТолькоРабочие Тогда
		#Если Сервер Тогда
			СписокРабочихДней = Новый СписокЗначений;
			СписокРабочихДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
			СписокРабочихДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("РабочийДень", СписокРабочихДней);
			Запрос.УстановитьПараметр("НачалоПериода", Дата);
			Запрос.УстановитьПараметр("КонецПериода", Дата + (2*КоличествоДней + 10)*24*60*60);
			Запрос.УстановитьПараметр("УчитыватьТолькоРабочие", УчитыватьТолькоРабочие);
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДанныеПроизводственногоКалендаря.Дата КАК Дата
			|ИЗ
			|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
			|ГДЕ
			|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И (НЕ &УчитыватьТолькоРабочие
			|			ИЛИ ДанныеПроизводственногоКалендаря.ВидДня В (&РабочийДень))
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
			
			ТаблицаДанных = Запрос.Выполнить().Выгрузить();
			Если ТаблицаДанных.Количество() < КоличествоДней + 1 Тогда
				Возврат Дата;				
			КонецЕсли;
			Если КоличествоДней = 0 Тогда
				Возврат ТаблицаДанных[0].Дата;
			Иначе
				 Если Дата = ТаблицаДанных[0].Дата Тогда
				 	Возврат ТаблицаДанных[КоличествоДней].Дата;
				Иначе
				 	Возврат ТаблицаДанных[КоличествоДней-1].Дата;
				 КонецЕсли;
			КонецЕсли;
		#КонецЕсли
	Иначе
		ОдинДень = 24*60*60;
		Возврат Дата + КоличествоДней * ОдинДень;
	КонецЕсли;
		
КонецФункции

#КонецОбласти
